<template>
  <div>
    <div class="jumbotron title py-sm-16 py-8 px-3 text-center">
      <h1 class="mt-4 mb-2 white--text font-weight-bold">
        ポケモノート
      </h1>
      <p class="white--text subtitle-1">
        ポケモンをより楽しむためのWebアプリ
      </p>
    </div>
    <v-container>
      <v-row class="d-flex my-sm-2">
        <v-col cols="12" md="6" class="d-flex order-md-2">
          <div class="contents flex-fill text-center m-auto">
            <h2 class="headline font-weight-bold ma-2 mb-3">フォローする</h2>
            <v-img
              src="../assets/lefmarna.png"
              class="mx-auto my-5"
              alt="レフマーナ"
              height="120px"
              width="120px"
            />
            <p><strong>レフマーナ</strong></p>
            <ul class="sosyal">
              <li class="twitter">
                <a
                  href="https://twitter.com/lefmarna"
                  target="_blank"
                  rel="noopener"
                  >Twitter</a
                >
              </li>
            </ul>
          </div>
        </v-col>
        <v-col cols="12" md="6" class="d-flex order-md-1">
          <div class="contents">
            <h2 class="headline font-weight-bold ma-2 mb-3 text-center">
              更新情報
            </h2>
            <v-sheet class="body-1 overflow-y-auto" max-height="280">
              <div class="px-2">
                <div>
                  <h3>2021-03-25</h3>
                  <p>
                    Twitterやブログなどで当サイトをシェアした際に、トップページの情報が展開されてしまっていた問題を解決しました。
                  </p>
                  <p>
                    ステータス計算機における個体値の表記を変更しました。これまでは186/186という表記でしたが、個体値の上限を意識することはほとんどないことから合計値のみが表示されるシンプルなUIにしました。
                  </p>
                  <h3>2021-02-17</h3>
                  <p>
                    ステータス計算機における「保存する」ボタンでの出力において、不要箇所のオプションが有効であっても、2行目の努力値が()で囲まれた状態で出力されてしまっていた不具合を修正しました。
                  </p>
                  <h3>2021-01-22</h3>
                  <p>
                    ステータス計算機における「保存する」ボタンでの出力において、不問箇所のチェックを3行目の実数値オンリー表示部分だけでなく、2行目の実数値(努力値)の表示においても有効になるよう修正しました。
                  </p>
                  <h3>2021-01-21</h3>
                  <p>
                    『ステータス計算機』において、「耐久調整」と「努力値リセット」のボタンを実装しました。実装にともない、デザインの微調整も行いました。
                  </p>
                  <p>
                    『ステータス計算機』において、種族値の合計も出力させるようにしました。
                  </p>
                  <p>
                    iOSのSafariブラウザにおいて、『ステータス計算機』や『素早さ計算機』の種族値の箇所が薄く見えにくい状態になっていた不具合を修正しました。
                  </p>
                  <p>
                    スマートフォンでボタンを連打していた際、ダブルタップ扱いとなって画面が拡大されてしまうのを防ぐようにしました。
                  </p>
                  <p>
                    ポケモンが指定されていない状態では、各種ボタンやページの遷移がうまく動作しなくなってしまう不具合を修正しました。
                  </p>
                  <h3>2021-01-17</h3>
                  <p>
                    ポケモンや性格をローマ字入力でも検索できるようにしました。
                  </p>
                  <h3>2020-12-18</h3>
                  <p>
                    外見は変わっていませんが、内部的な処理を大幅に書き換えています。動作がより安全になり、全体的なパフォーマンスも向上しました。
                  </p>
                  <h3>2020-11-29</h3>
                  <p>
                    『ステータス計算機』と『素早さ計算機』の計算結果を同期するようにし、スムーズに計算ができるようにしました。また、その他のページに遷移した際にも入力情報が失われないようになっています。
                  </p>
                  <p>
                    『ステータス計算機』で、ポケモンや性格の確定時にキーボードが閉じなかった不具合を修正しました。
                  </p>
                  <p>
                    『iPhoneSE』や『Garaxy
                    S5』といった小さいサイズのスマートフォンで、一部表示が崩れてしまっていた不具合を修正しました。
                  </p>
                  <h3>2020-11-13</h3>
                  <p>
                    『種族値ランキング』に、"剣盾に登場しないポケモン"の表示・非表示を切り替えるオプションを追加しました。
                  </p>
                  <h3>2020-11-10</h3>
                  <p>
                    新たに『種族値ランキング』のページを作成・公開しました。
                  </p>
                  <p>
                    各ページの上部にタイトルを挿入し、何のページを開いているのか分かりやすくしました。
                  </p>
                  <p>一部、デザインの微調整を行いました。</p>
                </div>
                <div>
                  <h3>2020-11-07</h3>
                  <p>デザイン及び機能を大幅にリニューアルしました。</p>
                  <p>『冠の雪原』のポケモンに対応しました。</p>
                  <p>
                    ステータス計算機において、努力値や個体値、レベルの入力で、上限を超えて入力できないようにしました。
                  </p>
                  <p>
                    ステータス計算機から別のページへ飛んで再び戻ってきた際に、元々計算していたポケモンを呼び出してすぐに計算を再開できるようにしました。
                  </p>
                  <p>その他、細かいバグを修正しました。</p>
                </div>
                <div>
                  <h3>2020-09-09</h3>
                  <p>アイコンを変更しました。</p>
                </div>
                <div>
                  <h3>2020-08-20</h3>
                  <p>ザルードに対応しました。</p>
                </div>
                <div>
                  <h3>2020-07-27</h3>
                  <p>『ステータス計算機』のUIを使いやすくしました。</p>
                </div>
                <div>
                  <h3>2020-07-14</h3>
                  <p>
                    『ステータス計算機』に『鎧の孤島』のポケモンを対応させました。
                  </p>
                  <p>『素早さ計算機』のUIを変更しました。</p>
                  <p>
                    『素早さ計算機』の計算の順番が一部間違っていた不具合を修正しました。
                  </p>
                </div>
                <div>
                  <h3>2020-06-22</h3>
                  <p>『素早さ計算機』を公開しました。</p>
                </div>
                <div>
                  <h3>2020-05-20</h3>
                  <p>
                    検索に引っかかるようにするため、『ステータス計算機』のタイトルを『ステータス計算機（ポケモン剣盾に対応）』に変更しました。
                  </p>
                </div>
                <div>
                  <h3>2020-05-14</h3>
                  <p>
                    『ステータス計算機』をスマホから表示した際、横にスクロールできてしまう（画面の表示がズレてしまう）不具合を修正しました。
                  </p>
                </div>
                <div>
                  <h3>2020-04-25</h3>
                  <p>
                    『ステータス計算機』の保存用エリアに、不要箇所のチェックを入れられるオプションを追加しました。
                  </p>
                  <p>
                    トップページをスマホから閲覧した際、「更新情報」が初期画面にあるとページのスクロールが難しくなってしまうため、「フォローする」を上に持ってくる形としました。
                  </p>
                </div>
                <div>
                  <h3>2020-04-24</h3>
                  <p>
                    『ステータス計算機』で[保存する]のボタンを押した際に「とつげきチョッキ」や「しんかのきせき」にチェックを入れていたかどうかも出力するようにしました。
                  </p>
                </div>
                <div>
                  <h3>2020-04-23</h3>
                  <p>
                    トップページのデザインが『利用規約』のデザインにも影響を及ぼしていた不具合を修正しました。
                  </p>
                  <p>
                    『ステータス計算機』をスマホで表示した際のレイアウトを少し変更しました。
                  </p>
                </div>
                <div>
                  <h3>2020-04-22</h3>
                  <p>
                    『ステータス計算機』におけるポケモン入力の候補選択を、キーボードの上下キーで移動できるようにしました。
                  </p>
                </div>
                <div>
                  <h3>2020-04-20</h3>
                  <p>サイト全体のデザインを変更しました。</p>
                </div>
                <div>
                  <h3>2020-04-19</h3>
                  <p>
                    『ステータス計算機』において、進化先の存在しないポケモンであっても『しんかのきせき』にチェックを入れることができていた不具合を修正しました。
                  </p>
                </div>
                <div>
                  <h3>2020-04-18</h3>
                  <p>
                    『ステータス計算機』におけるヌケニンのHPを修正しました。
                  </p>
                </div>
              </div>
            </v-sheet>
          </div>
        </v-col>
      </v-row>
      <v-row>
        <v-col cols="12">
          <div class="contents">
            <h2 class="headline font-weight-bold ma-2 mb-3 text-center">
              ポケモノートについて
            </h2>
            <div class="px-2">
              <p>
                『ポケモノート』は、ポケモンの攻略ブログ『<a
                  href="https://pokemonit.com/"
                  target="_blank"
                  rel="noopener noreferrer"
                  >ポケモニット</a
                >』を運営している『レフマーナ』による自作アプリ集です。
              </p>
              <p>
                SPA(シングルページアプリケーション)という技術を用いて制作しているため、当サイト内のリンクであれば読み込みがかからず、各ページ間の遷移をスムーズに行うことができます。
              </p>
              <p>
                当サイトは、個人の運営するファンサイトであり、株式会社ポケモンや任天堂、その他各企業様とは一切関係ありません。
              </p>
              <p>
                ポケットモンスター・ポケモン・Pokémonは任天堂・クリーチャーズ・ゲームフリークの登録商標です。
              </p>
            </div>
          </div>
        </v-col>
      </v-row>
    </v-container>
  </div>
</template>

<style lang="scss" scoped>
.jumbotron {
  background: url(../assets/top.jpg) center no-repeat;
  background-size: cover;
}

.sosyal {
  margin: 50px auto;
  list-style: none;
  padding-left: 0;
}

.twitter > a {
  background-color: #008dde;
  box-shadow: 0 4px 0 #595e61;

  display: inline;
  position: relative;
  font-family: Arial;
  font-size: 14px;
  font-weight: bold;
  text-align: center;
  text-decoration: none;
  color: white;
  border-radius: 5px;
  padding: 14px 80px;
  &:active {
    top: 2px;
    box-shadow: 0 2px 0 #0078bd;
  }
  &:hover {
    background-color: #1397d8;
  }
}

h3 {
  padding: 3px 0px;
  margin-bottom: 3px;
  border-bottom: double 5px #90caf9;
}
</style>
