<template>
  <div class="overflow-auto px-2">
    <div>
      <h3>2020-08-20</h3>
      <p>ザルードに対応しました。</p>
    </div>
    <div>
      <h3>2020-07-27</h3>
      <p>『ステータス計算機』のUIを使いやすくしました。</p>
    </div>
    <div>
      <h3>2020-07-14</h3>
      <p>『ステータス計算機』に『鎧の孤島』のポケモンを対応させました。</p>
      <p>『素早さ計算機』のUIを変更しました。</p>
      <p>
        『素早さ計算機』の計算の順番が一部間違っていた不具合を修正しました。
      </p>
    </div>
    <div>
      <h3>2020-06-22</h3>
      <p>『素早さ計算機』を公開しました。</p>
    </div>
    <div>
      <h3>2020-05-20</h3>
      <p>
        検索に引っかかるようにするため、『ステータス計算機』のタイトルを『ステータス計算機（ポケモン剣盾に対応）』に変更しました。
      </p>
    </div>
    <div>
      <h3>2020-05-14</h3>
      <p>
        『ステータス計算機』をスマホから表示した際、横にスクロールできてしまう（画面の表示がズレてしまう）不具合を修正しました。
      </p>
    </div>
    <div>
      <h3>2020-04-25</h3>
      <p>
        『ステータス計算機』の保存用エリアに、不要箇所のチェックを入れられるオプションを追加しました。
      </p>
      <p>
        トップページをスマホから閲覧した際、「更新情報」が初期画面にあるとページのスクロールが難しくなってしまうため、「フォローする」を上に持ってくる形としました。
      </p>
    </div>
    <div>
      <h3>2020-04-24</h3>
      <p>
        『ステータス計算機』で[保存する]のボタンを押した際に「とつげきチョッキ」や「しんかのきせき」にチェックを入れていたかどうかも出力するようにしました。
      </p>
    </div>
    <div>
      <h3>2020-04-23</h3>
      <p>
        トップページのデザインが『利用規約』のデザインにも影響を及ぼしていた不具合を修正しました。
      </p>
      <p>
        『ステータス計算機』をスマホで表示した際のレイアウトを少し変更しました。
      </p>
    </div>
    <div>
      <h3>2020-04-22</h3>
      <p>
        『ステータス計算機』におけるポケモン入力の候補選択を、キーボードの上下キーで移動できるようにしました。
      </p>
    </div>
    <div>
      <h3>2020-04-20</h3>
      <p>サイト全体のデザインを変更しました。</p>
    </div>
    <div>
      <h3>2020-04-19</h3>
      <p>
        『ステータス計算機』において、進化先の存在しないポケモンであっても『しんかのきせき』にチェックを入れることができていた不具合を修正しました。
      </p>
    </div>
    <div>
      <h3>2020-04-18</h3>
      <p>『ステータス計算機』におけるヌケニンのHPを修正しました。</p>
    </div>
  </div>
</template>

<style lang="scss" scoped>
.overflow-auto {
  height: 280px;
}
h3 {
  text-align: center;
  padding: 3px 0px;
  font-size: 1.5rem;
  border-bottom: double 5px #90caf9;
}
</style>
